<a href="https://colab.research.google.com/github/moonbeam87/Stonks/blob/master/sharpeRatio3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
from pandas_datareader import data
import matplotlib.pyplot as plt
import pandas as pd
import datetime as dt
from fbprophet import Prophet
import numpy as np
fb = pd.read_csv('https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol=' + 'FB' +'&apikey=WCXVE7BAD668SJHL&datatype=csv')
ibm = pd.read_csv('https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol=' + 'IBM' +'&apikey=WCXVE7BAD668SJHL&datatype=csv')
amzn = pd.read_csv('https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol=' + 'AMZN' +'&apikey=WCXVE7BAD668SJHL&datatype=csv')
google = pd.read_csv('https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol=' + 'GOOGL' +'&apikey=WCXVE7BAD668SJHL&datatype=csv')
apple = pd.read_csv('https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol=' + 'AAPL' +'&apikey=WCXVE7BAD668SJHL&datatype=csv')
for df in (fb, ibm, amzn, google, apple):
    df = df.rename(columns={"timestamp":"Date"})
    df = df.set_index('Date')
    df = df.sort_index()
    df['Normalized Return'] = df['close']/df.iloc[0]['close']

In [5]:
fb.head()

    timestamp      open     high     low   close    volume
0  2020-04-17  179.2000  180.280  176.66  179.24  20574003
1  2020-04-16  177.9500  178.050  172.51  176.25  23593229
2  2020-04-15  175.1865  178.190  172.82  176.97  17423003
3  2020-04-14  178.9765  181.225  176.62  178.17  21011815
4  2020-04-13  173.6700  175.000  169.45  174.79  19355355

In [0]:
fb = fb.rename(columns={'timestamp':'Date'})
fb = fb.set_index('Date')
fb = fb.sort_index()

In [7]:
fb.head()

               open    high       low   close    volume
Date
2019-11-22  198.380  199.30  197.6200  198.82   9959817
2019-11-25  199.515  200.97  199.2500  199.79  15286442
2019-11-26  200.000  200.15  198.0387  198.97  11748664
2019-11-27  199.900  203.14  199.4200  202.00  12760568
2019-11-29  201.600  203.80  201.2100  201.64   7985231

In [0]:
def getData(name):
  df = pd.read_csv('https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol=' + name +'&apikey=WCXVE7BAD668SJHL&datatype=csv')
  df = df.rename(columns={'timestamp':'Date'})
  df = df.set_index('Date')
  df = df.sort_index()

In [0]:
def getData(name):
  df = pd.read_csv('https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol=' + name +'&apikey=WCXVE7BAD668SJHL&datatype=csv')
  df = df.rename(columns={'timestamp':'Date'})
  df = df.set_index('Date')
  df = df.sort_index()
  return df

In [0]:
fb = getData('FB')
apple = getData('AAPL')
google = getData('GOOGL')
ibm = getData('IBM')
amzn = getData('AMZN')

In [11]:
fb.head()

               open    high       low   close    volume
Date
2019-11-22  198.380  199.30  197.6200  198.82   9959817
2019-11-25  199.515  200.97  199.2500  199.79  15286442
2019-11-26  200.000  200.15  198.0387  198.97  11748664
2019-11-27  199.900  203.14  199.4200  202.00  12760568
2019-11-29  201.600  203.80  201.2100  201.64   7985231

In [12]:
apple.head()

              open    high     low   close    volume
Date
2019-11-22  262.59  263.18  260.84  261.78  16331263
2019-11-25  262.71  266.44  262.52  266.37  21029517
2019-11-26  266.94  267.16  262.50  264.29  26334882
2019-11-27  265.58  267.98  265.31  267.84  16386122
2019-11-29  266.60  268.00  265.90  267.25  11654363

In [13]:
google.head()

               open     high      low    close   volume
Date
2019-11-22  1303.00  1306.90  1289.36  1293.67  1388912
2019-11-25  1296.26  1310.41  1295.61  1305.64  1179658
2019-11-26  1309.91  1314.01  1304.04  1313.00  1097089
2019-11-27  1315.42  1317.64  1309.47  1312.13   940536
2019-11-29  1306.60  1309.95  1303.23  1304.09   640069

In [14]:
ibm.head()

              open    high     low   close   volume
Date
2019-11-22  134.19  134.65  133.59  134.34  3297397
2019-11-25  134.47  136.00  134.35  135.97  2590146
2019-11-26  136.15  136.15  134.77  135.09  3806859
2019-11-27  135.35  135.71  133.62  133.77  3280699
2019-11-29  133.60  134.52  133.03  134.45  1825255

In [16]:
amzn.head()

               open     high      low    close   volume
Date
2019-11-22  1739.02  1746.43  1731.00  1745.72  2479081
2019-11-25  1753.25  1777.42  1753.24  1773.84  3489467
2019-11-26  1779.92  1797.03  1778.35  1796.94  3190428
2019-11-27  1801.00  1824.50  1797.31  1818.51  3035846
2019-11-29  1817.78  1824.69  1800.79  1800.80  1923440

In [0]:
def getData(name):
  df = pd.read_csv('https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol=' + name +'&apikey=WCXVE7BAD668SJHL&datatype=csv')
  df = df.rename(columns={'timestamp':'Date'})
  df = df.set_index('Date')
  df = df.sort_index()
  df = df.reset_index()
  return df